; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_4 ?v4 - type_2 ?v5 - type_1)
 	      (pred_1 ?v6 - object ?v5 - type_1)
	      (pred_2 ?v4 - type_2 ?v8 - type_3)
	      (pred_3 ?v4 - type_2 ?v6 - object ?v8 - type_3))

   (:action op_3
       :parameters  (?v4 - type_2 ?v1 ?v3 - type_1)
       :precondition (and  (pred_4 ?v4 ?v1))
       :effect (and  (pred_4 ?v4 ?v3)
		     (not (pred_4 ?v4 ?v1))))

   (:action op_1
       :parameters (?v4 - type_2 ?v2 - object ?v7 - type_1 ?v8 - type_3)
       :precondition  (and  (pred_1 ?v2 ?v7) (pred_4 ?v4 ?v7) (pred_2 ?v4 ?v8))
       :effect (and (pred_3 ?v4 ?v2 ?v8)
		    (not (pred_1 ?v2 ?v7)) 
		    (not (pred_2 ?v4 ?v8))))

   (:action op_2
       :parameters (?v4 - type_2 ?v2 - object ?v7 - type_1 ?v8 - type_3)
       :precondition  (and  (pred_3 ?v4 ?v2 ?v8) (pred_4 ?v4 ?v7))
       :effect (and (pred_1 ?v2 ?v7)
		    (pred_2 ?v4 ?v8)
		    (not (pred_3 ?v4 ?v2 ?v8)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_04 obj_02 - type_2
obj_10 obj_11 obj_07 obj_09 - type_3
obj_06 obj_08 obj_01 obj_03 - type_1
obj_13 obj_05 obj_12 - object)
(:init
(pred_4 obj_04 obj_01)
(pred_2 obj_04 obj_10)
(pred_2 obj_04 obj_11)
(pred_4 obj_02 obj_03)
(pred_2 obj_02 obj_07)
(pred_2 obj_02 obj_09)
(pred_1 obj_13 obj_01)
(pred_1 obj_05 obj_08)
(pred_1 obj_12 obj_03)
)
(:goal
(and
(pred_1 obj_13 obj_08)
(pred_1 obj_05 obj_08)
(pred_1 obj_12 obj_01)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_04 obj_01) (pred_4 obj_02 obj_01))))
  )
)
)

; plan
1. (op_1 obj_02 obj_12 obj_03 obj_09)
   deleted: (pred_1 obj_12 obj_03) (pred_2 obj_02 obj_09)
   added: (pred_3 obj_02 obj_12 obj_09)
   goals met: 1 of 3
2. (op_1 obj_04 obj_13 obj_01 obj_11)
   deleted: (pred_1 obj_13 obj_01) (pred_2 obj_04 obj_11)
   added: (pred_3 obj_04 obj_13 obj_11)
   goals met: 1 of 3
3. (op_3 obj_04 obj_01 obj_08)
   deleted: (pred_4 obj_04 obj_01)
   added: (pred_4 obj_04 obj_08)
   goals met: 1 of 3
4. (op_3 obj_02 obj_03 obj_01)
   deleted: (pred_4 obj_02 obj_03)
   added: (pred_4 obj_02 obj_01)
   goals met: 1 of 3
5. (op_2 obj_02 obj_12 obj_01 obj_09)
   deleted: (pred_3 obj_02 obj_12 obj_09)
   added: (pred_1 obj_12 obj_01) (pred_2 obj_02 obj_09)
   goals met: 2 of 3
6. (op_2 obj_04 obj_13 obj_08 obj_11)
   deleted: (pred_3 obj_04 obj_13 obj_11)
   added: (pred_1 obj_13 obj_08) (pred_2 obj_04 obj_11)
   goals met: 3 of 3
